app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE (rating = 'PG')
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG') ORDER BY release_date ASC
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G') AND "movies"."order" = 'release_date'
---
  def index
	#@test = params.inspect
	@selected  = Hash.new
	@selected = params["ratings"]
	@all_ratings = ['G','PG','PG-13','R']
	if @selected == nil
		@full_selected = @all_ratings.collect { |v| [v,1] }
			@selected = Hash[@full_selected]
	end
	@test = ""
	@selected.each_key {|key| @test += "ratings["+key.to_s()+"]=>1&"}

		@css1 = ""
		@css2 = ""
		if params[:id] != nil || params['utf8'] != nil
			@movies = Movie.all
			#@test = @selected.keys.to_s()
			@movies =Movie.where(rating: @selected.keys)
			if params[:id] == "1"
				@css1 = "hilite"
				@movies = Movie.where(rating: @selected.keys).order("title ASC")

			end
			if params[:id] == "2"
					@css2 = "hilite"
					@movies = Movie.where(rating: @selected.keys).order("release_date ASC")